// SPDX-License-Identifier: GPL-2.0+
/*
 * sun50i A133 platform dram controller driver
 *
 * Controller and PHY appear to be quite similar to that of the H616;
 * however certain offsets, timings, and other details are different enough that
 * the original code does not work as expected. Some device flags and
 * calibrations are not yet implemented, and configuration aside from DDR4
 * have not been tested.
 *
 * (C) Copyright 2024 MasterR3C0RD <masterr3c0rd@epochal.quest>
 *
 * Uses code from H616 driver, which is
 * (C) Copyright 2020 Jernej Skrabec <jernej.skrabec@siol.net>
 *
 */
#include "hardware.h"
#if WITHSDRAMHW && (CONFIG_SUNXI_DRAM_A133_LPDDR4) && 1
#include "formats.h"
#include "clocks.h"
#include <string.h>

#define max(a,b) (ulmax16((a), (b)))

#if 1
//https://github.com/u-boot/u-boot/blob/9b45d574af1b64fcd997f08fe702a2d0ecfccbe4/configs/liontron-h-a133l_defconfig#L5
#define CONFIG_DRAM_SUNXI_DX_ODT 0x7070707
#define CONFIG_DRAM_SUNXI_DX_DRI 0xd0d0d0d
#define CONFIG_DRAM_SUNXI_CA_DRI 0xe0e
#define CONFIG_DRAM_SUNXI_PARA0 0xd0a050c
#define CONFIG_DRAM_SUNXI_MR11 0x4
#define CONFIG_DRAM_SUNXI_MR12 0x72
#define CONFIG_DRAM_SUNXI_MR14 0x7
#define CONFIG_DRAM_SUNXI_TPR1 0x26
#define CONFIG_DRAM_SUNXI_TPR2 0x6060606
#define CONFIG_DRAM_SUNXI_TPR3 0x84040404
#define CONFIG_DRAM_SUNXI_TPR6 0x48000000
#define CONFIG_DRAM_SUNXI_TPR10 0x273333
#define CONFIG_DRAM_SUNXI_TPR11 0x231d151c
#define CONFIG_DRAM_SUNXI_TPR12 0x1212110e
#define CONFIG_DRAM_SUNXI_TPR13 0x7521

#define MBUS_CLK_M(m)			(((m)-1) << 0)

/* Module gate/reset shift*/
#define RESET_SHIFT			(16)
#define GATE_SHIFT			(0)

/* DRAM clock bit field */
#define DRAM_CLK_ENABLE			BIT_U32(31)
#define DRAM_MOD_RESET			BIT_U32(30)
#define DRAM_CLK_UPDATE			BIT_U32(27)
#define DRAM_CLK_SRC_MASK		GENMASK(25, 24)
#define DRAM_CLK_SRC_PLL5		(0 << 24)
#define DRAM_CLK_M_MASK			(0x1f)
#define DRAM_CLK_M(m)			(((m)-1) << 0)

/* MMC clock bit field */
#define CCM_MMC_CTRL_M(x)		((x) - 1)
#define CCM_MMC_CTRL_N(x)		((x) << 8)
#define CCM_MMC_CTRL_OSCM24		(0x0 << 24)
#define CCM_MMC_CTRL_PLL6		(0x1 << 24)
#define CCM_MMC_CTRL_PLL_PERIPH2X2	(0x2 << 24)
#define CCM_MMC_CTRL_ENABLE		(0x1 << 31)
/* H6 doesn't have these delays */
#define CCM_MMC_CTRL_OCLK_DLY(a)	((void) (a), 0)
#define CCM_MMC_CTRL_SCLK_DLY(a)	((void) (a), 0)



#if CONFIG_MACH_SUN50I_H6
	#define SUNXI_DRAM_COM_BASE		0x04002000
	#define SUNXI_DRAM_CTL0_BASE		0x04003000
	#define SUNXI_DRAM_PHY0_BASE		0x04005000
#endif
//#define SUNXI_NFC_BASE			0x04011000
//#define SUNXI_MMC0_BASE			0x04020000
//#define SUNXI_MMC1_BASE			0x04021000
//#define SUNXI_MMC2_BASE			0x04022000
#if CONFIG_MACH_SUN50I_T507 || CONFIG_MACH_SUN50I_H616
	#define SUNXI_DRAM_COM_BASE			0x047FA000
	#define SUNXI_DRAM_CTL0_BASE		0x047FB000
	#define SUNXI_DRAM_PHY0_BASE		0x04800000
#endif

#if CONFIG_MACH_SUN50I_A133
	// https://github.com/u-boot/u-boot/blob/d33b21b7e261691e8d6613a24cc9b0ececba3b01/arch/arm/include/asm/arch-sunxi/cpu_sun50i_h6.h#L33
	#define SUNXI_DRAM_COM_BASE			0x04810000
	#define SUNXI_DRAM_CTL0_BASE		0x04820000
	#define SUNXI_DRAM_PHY0_BASE		0x04830000
#endif

#define DRAM_CLK_ENABLE			BIT_U32(31)

#define SUNXI_PRCM_BASE			0x07010000

#define SUNXI_CCM_BASE CCU_BASE

#define DIV_ROUND_UP(n, d)	(((n) + (d) - 1) / (d))
#define REPEAT_BYTE(x)		((~0ul / 0xff) * (x))

/*
 * Wait up to 1s for value to be set in given part of reg.
 */
static void mctl_await_completion(uint32_t *reg, uint32_t mask, uint32_t val)
{
	//unsigned long tmo = timer_get_us() + 1000000;

	while ((read32((uintptr_t) reg) & mask) != val) {
//		if (timer_get_us() > tmo)
//			panic("Timeout initialising DRAM\n");
	}
}

// SPDX-License-Identifier:	GPL-2.0+
/*
 * A133 dram controller register and constant defines
 *
 * (C) Copyright 2024  MasterR3C0RD <masterr3c0rd@epochal.quest>
 */

#ifndef _SUNXI_DRAM_SUN50I_A133_H
#define _SUNXI_DRAM_SUN50I_A133_H

//#include <linux/bitops.h>

enum sunxi_dram_type {
	SUNXI_DRAM_TYPE_DDR3 = 3,
	SUNXI_DRAM_TYPE_DDR4,
	SUNXI_DRAM_TYPE_LPDDR3 = 7,
	SUNXI_DRAM_TYPE_LPDDR4
};

static inline int ns_to_t(int nanoseconds)
{
	const unsigned int ctrl_freq = CONFIG_DRAM_CLK / 2;

	return DIV_ROUND_UP(ctrl_freq * nanoseconds, 1000);
}

/* MBUS part is largely the same as in H6, except for one special register */
#define MCTL_COM_UNK_008	0x008
/* NOTE: This register has the same importance as mctl_ctl->clken in H616 */
#define MCTL_COM_MAER0		0x020

/*
 * Controller registers seems to be the same or at least very similar
 * to those in H6.
 */
struct sunxi_mctl_ctl_reg {
	uint32_t mstr; 			/* 0x000 */
	uint32_t statr; 			/* 0x004 unused */
	uint32_t mstr1; 			/* 0x008 unused */
	uint32_t clken; 			/* 0x00c */
	uint32_t mrctrl0; 			/* 0x010 unused */
	uint32_t mrctrl1; 			/* 0x014 unused */
	uint32_t mrstatr; 			/* 0x018 unused */
	uint32_t mrctrl2; 			/* 0x01c unused */
	uint32_t derateen; 			/* 0x020 unused */
	uint32_t derateint; 			/* 0x024 unused */
	uint8_t reserved_0x028[8]; 		/* 0x028 */
	uint32_t pwrctl; 			/* 0x030 unused */
	uint32_t pwrtmg; 			/* 0x034 unused */
	uint32_t hwlpctl; 			/* 0x038 unused */
	uint8_t reserved_0x03c[20];		/* 0x03c */
	uint32_t rfshctl0;			/* 0x050 unused */
	uint32_t rfshctl1;			/* 0x054 unused */
	uint8_t reserved_0x058[8];		/* 0x05c */
	uint32_t rfshctl3;			/* 0x060 */
	uint32_t rfshtmg;			/* 0x064 */
	uint8_t reserved_0x068[104];		/* 0x068 */
	uint32_t init[8];			/* 0x0d0 */
	uint32_t dimmctl;			/* 0x0f0 unused */
	uint32_t rankctl;			/* 0x0f4 */
	uint8_t reserved_0x0f8[8];		/* 0x0f8 */
	uint32_t dramtmg[17];		/* 0x100 */
	uint8_t reserved_0x144[60];		/* 0x144 */
	uint32_t zqctl[3];			/* 0x180 */
	uint32_t zqstat;			/* 0x18c unused */
	uint32_t dfitmg0;			/* 0x190 */
	uint32_t dfitmg1;			/* 0x194 */
	uint32_t dfilpcfg[2];		/* 0x198 unused */
	uint32_t dfiupd[3];			/* 0x1a0 */
	uint32_t reserved_0x1ac;		/* 0x1ac */
	uint32_t dfimisc;			/* 0x1b0 */
	uint32_t dfitmg2;			/* 0x1b4 unused */
	uint32_t dfitmg3;			/* 0x1b8 unused */
	uint32_t dfistat;			/* 0x1bc */
	uint32_t dbictl;			/* 0x1c0 */
	uint8_t reserved_0x1c4[60];		/* 0x1c4 */
	uint32_t addrmap[12];		/* 0x200 */
	uint8_t reserved_0x230[16];		/* 0x230 */
	uint32_t odtcfg;			/* 0x240 */
	uint32_t odtmap;			/* 0x244 */
	uint8_t reserved_0x248[8];		/* 0x248 */
	uint32_t sched[2];			/* 0x250 */
	uint8_t reserved_0x258[180]; 	/* 0x258 */
	uint32_t dbgcmd;			/* 0x30c unused */
	uint32_t dbgstat;			/* 0x310 unused */
	uint8_t reserved_0x314[12];		/* 0x314 */
	uint32_t swctl;			/* 0x320 */
	uint32_t swstat;			/* 0x324 */
	uint8_t reserved_0x328[7768];	/* 0x328 */
	uint32_t unk_0x2180;			/* 0x2180 */
	uint8_t reserved_0x2184[188];	/* 0x2184 */
	uint32_t unk_0x2240;			/* 0x2240 */
	uint8_t reserved_0x2244[3900];	/* 0x2244 */
	uint32_t unk_0x3180;			/* 0x3180 */
	uint8_t reserved_0x3184[188];	/* 0x3184 */
	uint32_t unk_0x3240;			/* 0x3240 */
	uint8_t reserved_0x3244[3900];	/* 0x3244 */
	uint32_t unk_0x4180;			/* 0x4180 */
	uint8_t reserved_0x4184[188];	/* 0x4184 */
	uint32_t unk_0x4240;			/* 0x4240 */
};

//check_member(sunxi_mctl_ctl_reg, swstat, 0x324);
//check_member(sunxi_mctl_ctl_reg, unk_0x4240, 0x4240);

#define MSTR_DEVICETYPE_DDR3	BIT_U32(0)
#define MSTR_DEVICETYPE_LPDDR2	BIT_U32(2)
#define MSTR_DEVICETYPE_LPDDR3	BIT_U32(3)
#define MSTR_DEVICETYPE_DDR4	BIT_U32(4)
#define MSTR_DEVICETYPE_LPDDR4	BIT_U32(5)
#define MSTR_DEVICETYPE_MASK	GENMASK(5, 0)
#define MSTR_GEARDOWNMODE	BIT_U32(0)		/* Same as MSTR_DEVICETYPE_DDR3, only used for DDR4 */
#define MSTR_2TMODE		BIT_U32(10)
#define MSTR_BUSWIDTH_FULL	(0 << 12)
#define MSTR_BUSWIDTH_HALF	(1 << 12)
#define MSTR_ACTIVE_RANKS(x)	(((x == 1) ? 3 : 1) << 24)
#define MSTR_BURST_LENGTH(x)	(((x) >> 1) << 16)
#define MSTR_DEVICECONFIG_X32	(3 << 30)

#define TPR10_CA_BIT_DELAY	BIT_U32(16)
#define TPR10_DX_BIT_DELAY0	BIT_U32(17)
#define TPR10_DX_BIT_DELAY1	BIT_U32(18)
#define TPR10_WRITE_LEVELING	BIT_U32(20)
#define TPR10_READ_CALIBRATION	BIT_U32(21)
#define TPR10_READ_TRAINING	BIT_U32(22)
