/*
 * a64_ddr3.c
 *
 *  Created on: 15 февр. 2023 г.
 *      Author: User
 */

#include "hardware.h"

#if CPUSTYLE_A64

#include "formats.h"

//#define PHYS_SDRAM_0 0x40000000
#define PHYS_SDRAM_0_SIZE (2u * 1024 * 1024 * 1024)

//#define SUNXI_SRAMC_BASE		0x01c00000
#define SUNXI_DRAMC_BASE	DRAMC_BASE//	0x01c01000
//#define SUNXI_DMA_BASE			0x01c02000
//#define SUNXI_NFC_BASE			0x01c03000

typedef uintptr_t virtual_addr_t;

// SPDX-License-Identifier: GPL-2.0+

static void udelay(unsigned us)
{
	local_delay_us(us * 1);
}

static uint32_t read32(uintptr_t addr)
{
	return * (volatile uint32_t *) addr;
}

static void write32(uintptr_t addr, uint32_t value)
{
	* (volatile uint32_t *) addr = value;
}

static void write32ptr(void * addr, uint32_t value)
{
	write32((uintptr_t) addr, value);
}

static uint32_t read32ptr(void * addr)
{
	return read32((uintptr_t) addr);
}

#define clrbits_le32(addr, clear) \
		write32ptr((addr), read32ptr(addr) & ~(clear))

#define setbits_le32(addr, set) \
		write32ptr((addr), read32ptr(addr) | (set))

#define clrsetbits_le32(addr, clear, set) \
		write32ptr((addr), (read32ptr(addr) & ~(clear)) | (set))

#define writel(data, addr) do { write32ptr((addr), (data)); } while (0)
#define readl(addr) (read32ptr(addr))
#define BIT_U32(pos) ((uint32_t) 1 << (pos))

// https://github.com/BPI-SINOVOIP/BPI-M64-bsp-4.4/blob/66bef0f2f30b367eb93b1cbad21ce85e0361f7ae/u-boot-sunxi/arch/arm/cpu/armv7/sunxi/dram.c

/*
 * (C) Copyright 2007-2015

//#define SUNXI_UART3_BASE			     (0x01c28c00L)
//#define SUNXI_UART4_BASE			     (0x01c29000L)
//
//#define SUNXI_TWI0_BASE			         (0x01c2ac00L)
//#define SUNXI_TWI1_BASE			         (0x01c2b000L)
//#define SUNXI_TWI2_BASE			         (0x01c2b400L)
//#define SUNXI_SCR_BASE			         (0x01c2c400L)
//
//#define SUNXI_EMAC_BASE			         (0x01c30000L)
//#define SUNXI_GPU_BASE			         (0x01c40000L)
//#define SUNXI_HSTMR_BASE			 (0x01c60000L)
//
//#define SUNXI_DRAMCOM_BASE		         (0x01c62000L)
//#define SUNXI_DRAMCTL0_BASE		         (0x01c63000L)
//#define SUNXI_DRAMPHY0_BASE		         (0x01c65000L)
//
//#define SUNXI_SPI0_BASE			         (0x01c68000L)
//#define SUNXI_SPI1_BASE			         (0x01c69000L)
//
//#define ARMA9_SCU_BASE		             (0x01c80000L)
//#define ARMA9_GIC_BASE		             (0x01c81000L)
//#define ARMA9_CPUIF_BASE	             (0x01c82000L)
//
//#define SUNXI_MIPI_DSI0_BASE		     (0x01ca0000L)
//#define SUNXI_MIPI_DSIPHY_BASE		     (0x01ca1000L)
//
//#define SUNXI_CSI0_BASE			         (0x01cb0000L)
//#define SUNXI_DE_INTERLACED_BASE		 (0x01e00000L)
//#define SUNXI_HDMI_BASE			         (0x01ee0000L)
////#define HDMI_BASE                                SUNXI_HDMI_BASE
//
//#define SUNXI_RTC_BASE			         (0x01f00000L)
//#define SUNXI_RTMR01_BASE		         (0x01f00800L)
//#define SUNXI_RINTC_BASE			 (0x01f00C00L)
//#define SUNXI_RWDOG_BASE			 (0x01f01000L)
//#define SUNXI_RPRCM_BASE			 (0x01f01400L)
//#define SUNXI_RTWD_BASE			         (0x01f01800L)
//#define SUNXI_RCPUCFG_BASE		         (0x01f01C00L)
//#define SUNXI_RCIR_BASE			         (0x01f02000L)
//#define SUNXI_RTWI_BASE			         (0x01f02400L)
//#define SUNXI_RUART_BASE			 (0x01f02800L)
//#define SUNXI_RPIO_BASE			         (0x01f02c00L)
//#define SUNXI_RRSB_BASE			         (0x01f03400L)
//#define SUNXI_RPWM_BASE			         (0x01f03800L)
//
//
//#define SUNXI_CPUX_CFG_BASE_A32           (0x01700000)
//#define RVBARADDR0_L		             (SUNXI_CPUX_CFG_BASE_A32+0xA0)
//#define RVBARADDR0_H		             (SUNXI_CPUX_CFG_BASE_A32+0xA4)
//#define RVBARADDR1_L		             (SUNXI_CPUX_CFG_BASE_A32+0xA8)
//#define RVBARADDR1_H		             (SUNXI_CPUX_CFG_BASE_A32+0xAC)
//#define RVBARADDR2_L		             (SUNXI_CPUX_CFG_BASE_A32+0xB0)
//#define RVBARADDR2_H		             (SUNXI_CPUX_CFG_BASE_A32+0xB4)
//#define RVBARADDR3_L		             (SUNXI_CPUX_CFG_BASE_A32+0xB8)
//#define RVBARADDR3_H		             (SUNXI_CPUX_CFG_BASE_A32+0xBC)

/*dram_para_offset is the numbers of u32 before dram data sturcture(dram_para) in struct arisc_para*/
#define SCP_DRAM_PARA_OFFSET                 (sizeof(u32) * 13 + sizeof(u32) + sizeof(u32) * 2 * 64)
#define SCP_DARM_PARA_NUM	             (24)

#endif

/*
 * sun4i, sun5i and sun7i clock register definitions
 *
 * (C) Copyright 2007-2011
 * Allwinner Technology Co., Ltd. <www.allwinnertech.com>
 * Tom Cubie <tangliang@allwinnertech.com>
 *
 * SPDX-License-Identifier:	GPL-2.0+
 */

#ifndef _SUNXI_CLOCK_SUN4I_H
#define _SUNXI_CLOCK_SUN4I_H

struct sunxi_ccm_reg {
	uint32_t pll1_cfg;		/* 0x00 pll1 control */
	uint32_t pll1_tun;		/* 0x04 pll1 tuning */
	uint32_t pll2_cfg;		/* 0x08 pll2 control */
	uint32_t pll2_tun;		/* 0x0c pll2 tuning */
	uint32_t pll3_cfg;		/* 0x10 pll3 control */
	uint8_t res0[0x4];
	uint32_t pll4_cfg;		/* 0x18 pll4 control */
	uint8_t res1[0x4];
	uint32_t pll5_cfg;		/* 0x20 pll5 control */
	uint32_t pll5_tun;		/* 0x24 pll5 tuning */
	uint32_t pll6_cfg;		/* 0x28 pll6 control */
	uint32_t pll6_tun;		/* 0x2c pll6 tuning */
	uint32_t pll7_cfg;		/* 0x30 pll7 control */
	uint32_t pll1_tun2;		/* 0x34 pll5 tuning2 */
	uint8_t res2[0x4];
	uint32_t pll5_tun2;		/* 0x3c pll5 tuning2 */
	uint8_t res3[0xc];
	uint32_t pll_lock_dbg;	/* 0x4c pll lock time debug */
	uint32_t osc24m_cfg;		/* 0x50 osc24m control */
	uint32_t cpu_ahb_apb0_cfg;	/* 0x54 cpu,ahb and apb0 divide ratio */
	uint32_t apb1_clk_div_cfg;	/* 0x58 apb1 clock dividor */
	uint32_t axi_gate;		/* 0x5c axi module clock gating */
	uint32_t ahb_gate0;		/* 0x60 ahb module clock gating 0 */
	uint32_t ahb_gate1;		/* 0x64 ahb module clock gating 1 */
	uint32_t apb0_gate;		/* 0x68 apb0 module clock gating */
	uint32_t apb1_gate;		/* 0x6c apb1 module clock gating */
	uint8_t res4[0x10];
	uint32_t nand_sclk_cfg;	/* 0x80 nand sub clock control */
	uint32_t ms_sclk_cfg;	/* 0x84 memory stick sub clock control */
	uint32_t sd0_clk_cfg;	/* 0x88 sd0 clock control */
	uint32_t sd1_clk_cfg;	/* 0x8c sd1 clock control */
	uint32_t sd2_clk_cfg;	/* 0x90 sd2 clock control */
	uint32_t sd3_clk_cfg;	/* 0x94 sd3 clock control */
	uint32_t ts_clk_cfg;		/* 0x98 transport stream clock control */
	uint32_t ss_clk_cfg;		/* 0x9c */
	uint32_t spi0_clk_cfg;	/* 0xa0 */
	uint32_t spi1_clk_cfg;	/* 0xa4 */
	uint32_t spi2_clk_cfg;	/* 0xa8 */
	uint32_t pata_clk_cfg;	/* 0xac */
	uint32_t ir0_clk_cfg;	/* 0xb0 */
	uint32_t ir1_clk_cfg;	/* 0xb4 */
	uint32_t iis_clk_cfg;	/* 0xb8 */
	uint32_t ac97_clk_cfg;	/* 0xbc */
	uint32_t spdif_clk_cfg;	/* 0xc0 */
	uint32_t keypad_clk_cfg;	/* 0xc4 */
	uint32_t sata_clk_cfg;	/* 0xc8 */
	uint32_t usb_clk_cfg;	/* 0xcc */
	uint32_t gps_clk_cfg;	/* 0xd0 */
	uint32_t spi3_clk_cfg;	/* 0xd4 */
	uint8_t res5[0x28];
	uint32_t dram_clk_cfg;	/* 0x100 */
	uint32_t be0_clk_cfg;	/* 0x104 */
	uint32_t be1_clk_cfg;	/* 0x108 */
	uint32_t fe0_clk_cfg;	/* 0x10c */
	uint32_t fe1_clk_cfg;	/* 0x110 */
	uint32_t mp_clk_cfg;		/* 0x114 */
	uint32_t lcd0_ch0_clk_cfg;	/* 0x118 */
	uint32_t lcd1_ch0_clk_cfg;	/* 0x11c */
	uint32_t csi_isp_clk_cfg;	/* 0x120 */
	uint8_t res6[0x4];
	uint32_t tvd_clk_reg;	/* 0x128 */
	uint32_t lcd0_ch1_clk_cfg;	/* 0x12c */
	uint32_t lcd1_ch1_clk_cfg;	/* 0x130 */
	uint32_t csi0_clk_cfg;	/* 0x134 */
	uint32_t csi1_clk_cfg;	/* 0x138 */
	uint32_t ve_clk_cfg;		/* 0x13c */
	uint32_t audio_codec_clk_cfg;	/* 0x140 */
	uint32_t avs_clk_cfg;	/* 0x144 */
	uint32_t ace_clk_cfg;	/* 0x148 */
	uint32_t lvds_clk_cfg;	/* 0x14c */
	uint32_t hdmi_clk_cfg;	/* 0x150 */
	uint32_t mali_clk_cfg;	/* 0x154 */
	uint8_t res7[0x4];
	uint32_t mbus_clk_cfg;	/* 0x15c */
	uint8_t res8[0x4];
	uint32_t gmac_clk_cfg;	/* 0x164 */
};

/* apb1 bit field */
#define APB1_CLK_SRC_OSC24M		(0x0 << 24)
#define APB1_CLK_SRC_PLL6		(0x1 << 24)
#define APB1_CLK_SRC_LOSC		(0x2 << 24)
#define APB1_CLK_SRC_MASK		(0x3 << 24)
#define APB1_CLK_RATE_N_1		(0x0 << 16)
#define APB1_CLK_RATE_N_2		(0x1 << 16)
#define APB1_CLK_RATE_N_4		(0x2 << 16)
#define APB1_CLK_RATE_N_8		(0x3 << 16)
#define APB1_CLK_RATE_N_MASK		(3 << 16)
#define APB1_CLK_RATE_M(m)		(((m)-1) << 0)
#define APB1_CLK_RATE_M_MASK            (0x1f << 0)

/* apb1 gate field */
#define APB1_GATE_UART_SHIFT	(16)
#define APB1_GATE_UART_MASK		(0xff << APB1_GATE_UART_SHIFT)
#define APB1_GATE_TWI_SHIFT	(0)
#define APB1_GATE_TWI_MASK		(0xf << APB1_GATE_TWI_SHIFT)

/* clock divide */
#define AXI_DIV_SHIFT		(0)
#define AXI_DIV_1			0
#define AXI_DIV_2			1
#define AXI_DIV_3			2
#define AXI_DIV_4			3
#define AHB_DIV_SHIFT		(4)
#define AHB_DIV_1			0
#define AHB_DIV_2			1
#define AHB_DIV_4			2
#define AHB_DIV_8			3
#define APB0_DIV_SHIFT		(8)
#define APB0_DIV_1			0
#define APB0_DIV_2			1
#define APB0_DIV_4			2
#define APB0_DIV_8			3
#define CPU_CLK_SRC_SHIFT	(16)
#define CPU_CLK_SRC_OSC24M		1
#define CPU_CLK_SRC_PLL1		2

#define CCM_PLL1_CFG_ENABLE_SHIFT		31
#define CCM_PLL1_CFG_VCO_RST_SHIFT		30
#define CCM_PLL1_CFG_VCO_BIAS_SHIFT		26
#define CCM_PLL1_CFG_PLL4_EXCH_SHIFT		25
#define CCM_PLL1_CFG_BIAS_CUR_SHIFT		20
#define CCM_PLL1_CFG_DIVP_SHIFT			16
#define CCM_PLL1_CFG_LCK_TMR_SHIFT		13
#define CCM_PLL1_CFG_FACTOR_N_SHIFT		8
#define CCM_PLL1_CFG_FACTOR_K_SHIFT		4
#define CCM_PLL1_CFG_SIG_DELT_PAT_IN_SHIFT	3
#define CCM_PLL1_CFG_SIG_DELT_PAT_EN_SHIFT	2
#define CCM_PLL1_CFG_FACTOR_M_SHIFT		0

#define PLL1_CFG_DEFAULT	0xa1005000

#define PLL6_CFG_DEFAULT	0xa1009911

/* nand clock */
#define NAND_CLK_SRC_OSC24		0
#define NAND_CLK_DIV_N			0
#define NAND_CLK_DIV_M			0

/* gps clock */
#define GPS_SCLK_GATING_OFF		0
#define GPS_RESET			0

/* ahb clock gate bit offset */
#define AHB_GATE_OFFSET_GPS		26
#define AHB_GATE_OFFSET_SATA		25
#define AHB_GATE_OFFSET_PATA		24
#define AHB_GATE_OFFSET_SPI3		23
#define AHB_GATE_OFFSET_SPI2		22
#define AHB_GATE_OFFSET_SPI1		21
#define AHB_GATE_OFFSET_SPI0		20
#define AHB_GATE_OFFSET_TS0		18
#define AHB_GATE_OFFSET_EMAC		17
#define AHB_GATE_OFFSET_ACE		16
#define AHB_GATE_OFFSET_DLL		15
#define AHB_GATE_OFFSET_SDRAM		14
#define AHB_GATE_OFFSET_NAND		13
#define AHB_GATE_OFFSET_MS		12
#define AHB_GATE_OFFSET_MMC3		11
#define AHB_GATE_OFFSET_MMC2		10
#define AHB_GATE_OFFSET_MMC1		9
#define AHB_GATE_OFFSET_MMC0		8
#define AHB_GATE_OFFSET_MMC(n)		(AHB_GATE_OFFSET_MMC0 + (n))
#define AHB_GATE_OFFSET_BIST		7
#define AHB_GATE_OFFSET_DMA		6
#define AHB_GATE_OFFSET_SS		5
#define AHB_GATE_OFFSET_USB_OHCI1	4
#define AHB_GATE_OFFSET_USB_EHCI1	3
#define AHB_GATE_OFFSET_USB_OHCI0	2
#define AHB_GATE_OFFSET_USB_EHCI0	1
#define AHB_GATE_OFFSET_USB		0

/* ahb clock gate bit offset (second register) */
#define AHB_GATE_OFFSET_GMAC		17

#define CCM_AHB_GATE_GPS (0x1 << 26)
#define CCM_AHB_GATE_SDRAM (0x1 << 14)
#define CCM_AHB_GATE_DLL (0x1 << 15)
#define CCM_AHB_GATE_ACE (0x1 << 16)

#define CCM_PLL5_CTRL_M(n) (((n) & 0x3) << 0)
#define CCM_PLL5_CTRL_M_MASK CCM_PLL5_CTRL_M(0x3)
#define CCM_PLL5_CTRL_M_X(n) ((n) - 1)
#define CCM_PLL5_CTRL_M1(n) (((n) & 0x3) << 2)
#define CCM_PLL5_CTRL_M1_MASK CCM_PLL5_CTRL_M1(0x3)
#define CCM_PLL5_CTRL_M1_X(n) ((n) - 1)
#define CCM_PLL5_CTRL_K(n) (((n) & 0x3) << 4)
#define CCM_PLL5_CTRL_K_MASK CCM_PLL5_CTRL_K(0x3)
#define CCM_PLL5_CTRL_K_X(n) ((n) - 1)
#define CCM_PLL5_CTRL_LDO (0x1 << 7)
#define CCM_PLL5_CTRL_N(n) (((n) & 0x1f) << 8)
#define CCM_PLL5_CTRL_N_MASK CCM_PLL5_CTRL_N(0x1f)
#define CCM_PLL5_CTRL_N_X(n) (n)
#define CCM_PLL5_CTRL_P(n) (((n) & 0x3) << 16)
#define CCM_PLL5_CTRL_P_MASK CCM_PLL5_CTRL_P(0x3)
#define CCM_PLL5_CTRL_P_X(n) ((n) - 1)
#define CCM_PLL5_CTRL_BW (0x1 << 18)
#define CCM_PLL5_CTRL_VCO_GAIN (0x1 << 19)
#define CCM_PLL5_CTRL_BIAS(n) (((n) & 0x1f) << 20)
#define CCM_PLL5_CTRL_BIAS_MASK CCM_PLL5_CTRL_BIAS(0x1f)
#define CCM_PLL5_CTRL_BIAS_X(n) ((n) - 1)
#define CCM_PLL5_CTRL_VCO_BIAS (0x1 << 25)
#define CCM_PLL5_CTRL_DDR_CLK (0x1 << 29)
#define CCM_PLL5_CTRL_BYPASS (0x1 << 30)
#define CCM_PLL5_CTRL_EN (0x1 << 31)

#define CCM_PLL6_CTRL_N_SHIFT	8
#define CCM_PLL6_CTRL_N_MASK	(0x1f << CCM_PLL6_CTRL_N_SHIFT)
#define CCM_PLL6_CTRL_K_SHIFT	4
#define CCM_PLL6_CTRL_K_MASK	(0x3 << CCM_PLL6_CTRL_K_SHIFT)

#define CCM_GPS_CTRL_RESET (0x1 << 0)
#define CCM_GPS_CTRL_GATE (0x1 << 1)

#define CCM_DRAM_CTRL_DCLK_OUT (0x1 << 15)

#define CCM_MBUS_CTRL_M(n) (((n) & 0xf) << 0)
#define CCM_MBUS_CTRL_M_MASK CCM_MBUS_CTRL_M(0xf)
#define CCM_MBUS_CTRL_M_X(n) ((n) - 1)
#define CCM_MBUS_CTRL_N(n) (((n) & 0xf) << 16)
#define CCM_MBUS_CTRL_N_MASK CCM_MBUS_CTRL_N(0xf)
#define CCM_MBUS_CTRL_N_X(n) (((n) >> 3) ? 3 : (((n) >> 2) ? 2 : (((n) >> 1) ? 1 : 0)))
#define CCM_MBUS_CTRL_CLK_SRC(n) (((n) & 0x3) << 24)
#define CCM_MBUS_CTRL_CLK_SRC_MASK CCM_MBUS_CTRL_CLK_SRC(0x3)
#define CCM_MBUS_CTRL_CLK_SRC_HOSC 0x0
#define CCM_MBUS_CTRL_CLK_SRC_PLL6 0x1
#define CCM_MBUS_CTRL_CLK_SRC_PLL5 0x2
#define CCM_MBUS_CTRL_GATE (0x1 << 31)

#define CCM_MMC_CTRL_OSCM24 (0x0 << 24)
#define CCM_MMC_CTRL_PLL6   (0x1 << 24)
#define CCM_MMC_CTRL_PLL5   (0x2 << 24)

#define CCM_MMC_CTRL_ENABLE (0x1 << 31)

#define CCM_GMAC_CTRL_TX_CLK_SRC_MII 0x0
#define CCM_GMAC_CTRL_TX_CLK_SRC_EXT_RGMII 0x1
#define CCM_GMAC_CTRL_TX_CLK_SRC_INT_RGMII 0x2
#define CCM_GMAC_CTRL_GPIT_MII (0x0 << 2)
#define CCM_GMAC_CTRL_GPIT_RGMII (0x1 << 2)

#endif /* _SUNXI_CLOCK_SUN4I_H */
/*
 * (C) Copyright 2007-2012
 * Allwinner Technology Co., Ltd. <www.allwinnertech.com>
 * Berg Xing <bergxing@allwinnertech.com>
 * Tom Cubie <tangliang@allwinnertech.com>
 *
 * Sunxi platform dram register definition.
 *
 * SPDX-License-Identifier:	GPL-2.0+
 */

#ifndef _SUNXI_DRAM_H
#define _SUNXI_DRAM_H

//#include <linux/types.h>

struct sunxi_dram_reg {
	uint32_t ccr;		/* 0x00 controller configuration register */
	uint32_t dcr;		/* 0x04 dram configuration register */
	uint32_t iocr;		/* 0x08 i/o configuration register */
	uint32_t csr;		/* 0x0c controller status register */
	uint32_t drr;		/* 0x10 dram refresh register */
	uint32_t tpr0;		/* 0x14 dram timing parameters register 0 */
	uint32_t tpr1;		/* 0x18 dram timing parameters register 1 */
	uint32_t tpr2;		/* 0x1c dram timing parameters register 2 */
	uint32_t gdllcr;		/* 0x20 global dll control register */
	uint8_t res0[0x28];
	uint32_t rslr0;		/* 0x4c rank system latency register */
	uint32_t rslr1;		/* 0x50 rank system latency register */
	uint8_t res1[0x8];
	uint32_t rdgr0;		/* 0x5c rank dqs gating register */
	uint32_t rdgr1;		/* 0x60 rank dqs gating register */
	uint8_t res2[0x34];
	uint32_t odtcr;		/* 0x98 odt configuration register */
	uint32_t dtr0;		/* 0x9c data training register 0 */
	uint32_t dtr1;		/* 0xa0 data training register 1 */
	uint32_t dtar;		/* 0xa4 data training address register */
	uint32_t zqcr0;		/* 0xa8 zq control register 0 */
	uint32_t zqcr1;		/* 0xac zq control register 1 */
	uint32_t zqsr;		/* 0xb0 zq status register */
	uint32_t idcr;		/* 0xb4 initializaton delay configure reg */
	uint8_t res3[0x138];
	uint32_t mr;			/* 0x1f0 mode register */
	uint32_t emr;		/* 0x1f4 extended mode register */
	uint32_t emr2;		/* 0x1f8 extended mode register */
	uint32_t emr3;		/* 0x1fc extended mode register */
	uint32_t dllctr;		/* 0x200 dll control register */
	uint32_t dllcr[5];		/* 0x204 dll control register 0(byte 0) */
	/* 0x208 dll control register 1(byte 1) */
	/* 0x20c dll control register 2(byte 2) */
	/* 0x210 dll control register 3(byte 3) */
	/* 0x214 dll control register 4(byte 4) */
	uint32_t dqtr0;		/* 0x218 dq timing register */
	uint32_t dqtr1;		/* 0x21c dq timing register */
	uint32_t dqtr2;		/* 0x220 dq timing register */
	uint32_t dqtr3;		/* 0x224 dq timing register */
	uint32_t dqstr;		/* 0x228 dqs timing register */
	uint32_t dqsbtr;		/* 0x22c dqsb timing register */
	uint32_t mcr;		/* 0x230 mode configure register */
	uint8_t res[0x8];
	uint32_t ppwrsctl;		/* 0x23c pad power save control */
	uint32_t apr;		/* 0x240 arbiter period register */
	uint32_t pldtr;		/* 0x244 priority level data threshold reg */
	uint8_t res5[0x8];
	uint32_t hpcr[32];		/* 0x250 host port configure register */
	uint8_t res6[0x10];
	uint32_t csel;		/* 0x2e0 controller select register */
};

struct dram_para {
	uint32_t clock;
	uint32_t type;
	uint32_t rank_num;
	uint32_t density;
	uint32_t io_width;
	uint32_t bus_width;
	uint32_t cas;
	uint32_t zq;
	uint32_t odt_en;
	uint32_t size;
	uint32_t tpr0;
	uint32_t tpr1;
	uint32_t tpr2;
	uint32_t tpr3;
	uint32_t tpr4;
	uint32_t tpr5;
	uint32_t emr1;
	uint32_t emr2;
	uint32_t emr3;
};

#define DRAM_CCR_COMMAND_RATE_1T (0x1 << 5)
#define DRAM_CCR_DQS_GATE (0x1 << 14)
#define DRAM_CCR_DQS_DRIFT_COMP (0x1 << 17)
#define DRAM_CCR_ITM_OFF (0x1 << 28)
#define DRAM_CCR_DATA_TRAINING (0x1 << 30)
#define DRAM_CCR_INIT (0x1 << 31)

#define DRAM_MEMORY_TYPE_DDR1 1
#define DRAM_MEMORY_TYPE_DDR2 2
#define DRAM_MEMORY_TYPE_DDR3 3
#define DRAM_MEMORY_TYPE_LPDDR2 4
#define DRAM_MEMORY_TYPE_LPDDR 5
#define DRAM_DCR_TYPE (0x1 << 0)
#define DRAM_DCR_TYPE_DDR2 0x0
#define DRAM_DCR_TYPE_DDR3 0x1
#define DRAM_DCR_IO_WIDTH(n) (((n) & 0x3) << 1)
